base/Documents/бит_УтверждениеСоставаИнвесторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УтверждениеСоставаИнвесторов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоставИнвесторов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектИнвестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставИнвесторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акционер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_ВидыИнвесторов</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляВладения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_УтверждениеСоставаИнвесторов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = Документы.бит_УтверждениеСоставаИнвесторов.ПараметрыПроведения(Ссылка);
	Документы.бит_УтверждениеСоставаИнвесторов.СформироватьСоставИнвесторов(Движения, ПараметрыПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьУникальностьАкционеров(Отказ);
	
	// Выполним проверку: сумма по "ДоляВладения" должна быть равна 100%.
	Если (СоставИнвесторов.Итог("ДоляВладения") <> 100) И (СоставИнвесторов.Количество() > 0) Тогда
		СтрокаОшибок = НСтр("ru='Сумма по колонке ""Доля владения"" не равна 100%'");
		ОбщегоНазначения.СообщитьПользователю(СтрокаОшибок, Ссылка,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьАкционеров(Отказ)
	
	ШаблонОшибки = НСтр("ru = 'В составе инвесторов присутствуют несколько строк с акционером %1'");
	ШаблонПоля   = "СоставИнвесторов[%1].Акционер";
	
	Акционеры = Новый Соответствие;
	Для каждого СтрокаТаблицы  Из СоставИнвесторов Цикл
		УжеИспользуется = (Акционеры.Получить(СтрокаТаблицы.Акционер) <> Неопределено);  
		Если УжеИспользуется Тогда
			Поле        = СтрШаблон(ШаблонПоля, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
			ТекстОшибки = СтрШаблон(ШаблонОшибки, СтрокаТаблицы.Акционер);
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"КОЛОНКА","КОРРЕКТНОСТЬ", НСтр("ru='Акционер'"), СтрокаТаблицы.НомерСтроки,
								НСтр("ru='Состав инвесторов'"), ТекстОшибки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		Иначе  
			Акционеры.Вставить(СтрокаТаблицы.Акционер, Истина);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли
